#Создать список и заполнить его элементами различных типов данных. Реализовать скрипт проверки типа данных каждого элемента.
# Использовать функцию type() для проверки типа. Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.

new_list = ['Test', 245, True, 98.6,['my', 'name', 'is']]

for i in new_list:
    print(type(i))

